haskell/Algebraic_Data_Types.org
#+INCLUDE: ../theme/style.org
#+TITLE: Algebraic Data Types 

* Algebraic Data Types

[Under Construction]

** Overview 

[[http://en.wikipedia.org/wiki/Algebraic_data_type][Algebraic data type]] is a type formed by combining types. It can be
used to implement Records, Enumerated Sets, option type and Recursive
types. Note: Algebraic data types must not be confused with [[http://en.wikipedia.org/wiki/Abstract_data_type][Abstract
data types]].

 - Applications of Algebraic Data Types

    * Build Embedded Domain specific languages - EDSL
    * Build Interpreters
    * Self Documenting code
    * Avoid Null checking error/ Null reference bug


 - Product Types
    * Tuples of types   - (Int, Float)
    * Records
    
 - Sum Types
    *  Tagged or disjoint unions or variant types

 - Enumerated types

 - [[http://en.wikipedia.org/wiki/Option_type][Option Type]]

Option type is useful in functional programming to avoid boilerplate
null checking bug on non-deterministic computations.

| Language     | Syntax                                                              |            |
|--------------+---------------------------------------------------------------------+------------|
| Haskell      | data Maybe a = Nothing                                              | Just a     |
| OCaml and F# | type 'a option = None                                               | Some of 'a |
| Standard ML  | datatype 'a option = NONE                                           | SOME of 'a |
| Java 8       | the option type is defined as parameterized final class Optional<T> |            |


See also: 

 - [[http://fsharpforfunandprofit.com/series/designing-with-types.html][The "Designing with types" series - F# for fun and for profiting]]
 - [[http://en.wikibooks.org/wiki/F_Sharp_Programming/Option_Types][F# : Option Types]]
 - [[http://fsharpforfunandprofit.com/ddd/][Domain Driven Design]]

*Selected Wikipedia Pages*

 - [[http://en.wikipedia.org/wiki/Algebraic_data_type][Algebraic data type]]
 - [[http://en.wikipedia.org/wiki/Disjoint_union][Dijoint Union]]
 - [[http://en.wikipedia.org/wiki/Product_type][Product Type]]
 - [[http://en.wikipedia.org/wiki/Type_theory][Type Theory]]
 - [[http://en.wikipedia.org/wiki/Recursive_data_type][Recursive data type]]
 - [[http://en.wikipedia.org/wiki/Record_(computer_science][Record (computer science)]])
 - [[http://en.wikipedia.org/wiki/Enumerated_type][Enumerated type]]
 - [[http://en.wikipedia.org/wiki/Option_type][Option Type]]

 - [[http://en.wikipedia.org/wiki/Abstract_data_type][Abstract data type]]

