haskell/Algebraic_Data_Types.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Algebraic Data Types</title>
<!-- 2016-03-22 Tue 04:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Caio Rodrigues" />
<link href="/Functional-Programming/theme/style.css" rel="stylesheet">


</head>
<body>
<div id="content">
<h1 class="title">Algebraic Data Types</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Algebraic Data Types</a>
<ul>
<li><a href="#sec-1-1">1.1. Overview</a></li>
<li><a href="#sec-1-2">1.2. Enumerated Data Type</a></li>
<li><a href="#sec-1-3">1.3. Typeclass without Record Syntax</a></li>
<li><a href="#sec-1-4">1.4. Record Syntax</a></li>
<li><a href="#sec-1-5">1.5. Recursive Data Types</a></li>
</ul>
</li>
</ul>
</div>
</div>
<lu> 
  <li><a href="/Functional-Programming/README.html">Index</a></li>
  <li><a href="https://github.com/caiorss/Functional-Programming">Repository</a></li>
</lu>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Algebraic Data Types</h2>
<div class="outline-text-2" id="text-1">
<p>
[Under Construction]
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="http://en.wikipedia.org/wiki/Algebraic_data_type">Algebraic data type</a> is a type formed by combining types. It can be
used to implement Records, Enumerated Sets, option type and Recursive
types. Note: Algebraic data types must not be confused with <a href="http://en.wikipedia.org/wiki/Abstract_data_type">Abstract
data types</a>.
</p>

<ul class="org-ul">
<li>Applications of Algebraic Data Types
<ul class="org-ul">
<li>Build Embedded Domain specific languages - EDSL
</li>
<li>Build Interpreters
</li>
<li>Self Documenting code
</li>
<li>Avoid Null checking error/ Null reference bug
</li>
</ul>
</li>
</ul>


<ul class="org-ul">
<li>Product Types
<ul class="org-ul">
<li>Tuples of types   - (Int, Float)
</li>
<li>Records
</li>
</ul>
</li>

<li>Sum Types
<ul class="org-ul">
<li>Tagged or disjoint unions or variant types
</li>
</ul>
</li>

<li>Enumerated types
</li>

<li><a href="http://en.wikipedia.org/wiki/Option_type">Option Type</a>
</li>
</ul>

<p>
Option type is useful in functional programming to avoid boilerplate
null checking bug on non-deterministics computations.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Language</th>
<th scope="col" class="left">Syntax</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Haskell</td>
<td class="left">data Maybe a = Nothing</td>
<td class="left">Just a</td>
</tr>

<tr>
<td class="left">OCaml and F#</td>
<td class="left">type 'a option = None</td>
<td class="left">Some of 'a</td>
</tr>

<tr>
<td class="left">Standard ML</td>
<td class="left">datatype 'a option = NONE</td>
<td class="left">SOME of 'a</td>
</tr>

<tr>
<td class="left">Java 8</td>
<td class="left">the option type is defined as parameterized final class Optional&lt;T&gt;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>


<p>
See also: 
</p>

<ul class="org-ul">
<li><a href="http://fsharpforfunandprofit.com/series/designing-with-types.html">The "Designing with types" series - F# for fun and for profiting</a>
</li>
<li><a href="http://en.wikibooks.org/wiki/F_Sharp_Programming/Option_Types">F# : Option Types</a>
</li>
<li><a href="http://fsharpforfunandprofit.com/ddd/">Domain Driven Design</a>
</li>
</ul>

<p>
<b>Selected Wikipedia Pages</b>
</p>

<ul class="org-ul">
<li><a href="http://en.wikipedia.org/wiki/Algebraic_data_type">Algebraic data type</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Disjoint_union">Dijoint Union</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Product_type">Product Type</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Type_theory">Type Theory</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Recursive_data_type">Recursive data type</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Record_(computer_science">Record (computer science)</a>)
</li>
<li><a href="http://en.wikipedia.org/wiki/Enumerated_type">Enumerated type</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Option_type">Option Type</a>
</li>

<li><a href="http://en.wikipedia.org/wiki/Abstract_data_type">Abstract data type</a>
</li>
</ul>
</div>
</div>
