haskell/Algebraic_Data_Types.org
** Enumerated Data Type

*Example: Days of Week*

Enumerated sets is type which can only have a limited number of values. 


#+BEGIN_SRC haskell

data Weekday = Monday
             | Tuesday
             | Wednesday
             | Thursday
             | Friday
             | Saturday
             | Sunday
  deriving (Eq, Ord, Enum)

fromDay :: Weekday -> Int
fromDay = fromEnum

toDay :: Int -> Weekday
toDay = toEnum   

> map (Monday<) [ Tuesday, Friday, Sunday]
[True,True,True]

> map (Thursday<) [Monday, Tuesday, Friday, Sunday]
[False,False,True,True]

> 
> Monday == Tuesday
False
> Tuesday == Tuesday
True
>  

> 
> fromDay Saturday 
5

> 1 + fromDay Monday 
1
> 1 + fromDay Saturday 
6
> Saturday 
Saturday
> 
> toDay 0
Monday
> toDay 6
Sunday
> 
> 


#+END_SRC

*Example: Colors*

#+BEGIN_SRC haskell

data Color
    = Red
    | Orange
    | Yellow
    | Green
    | Blue
    | Purple
    | White
    | Black
    | CustomColor Int Int Int -- R G B components
    deriving (Eq)

colorToRGB Red    = (255,0,0)
colorToRGB Orange = (255,128,0)
colorToRGB Yellow = (255,255,0)
colorToRGB Green  = (0,255,0)
colorToRGB Blue   = (0,0,255)
colorToRGB Purple = (255,0,255)
colorToRGB White = (255,255,255)
colorToRGB Black = (0,0,0)
colorToRGB (CustomColor r g b) = (r,g,b)   -- this one is new
 
    
> 
> Red == White
False
> 
> Red == Red
True
> 

> let b = CustomColor 120 240 100
> colorToRGB b
(120,240,100)

> map colorToRGB [ Blue, White, Yellow ]
[(0,0,255),(255,255,255),(255,255,0)]
> 


#+END_SRC

*Example: Shapes*

#+BEGIN_SRC haskell

data Shape = Circle  Float 
            | Rect   Float Float 
            deriving Show

square   :: Float -> Shape
square n =  Rect n n 

area            :: Shape -> Float
area (Circle r)  = pi * r^2
area (Rect x y)  = x  * y

is_circle (Circle _ ) = True
is_circle _           = False

is_rect   (Rect _ _)  = True
is_rect   _           = False

describe (Circle radius) = putStrLn $ "Circle of radius : " ++ show(radius) 
describe (Rect h w)      = putStrLn $ "Rectangle of " ++ show(h) ++ " x " ++ show(w)

> area $  Rect 20 30
600.0
> area $ Circle 20
1256.6371
> area $ square 20
400.0
> 
> [Rect 20.0 30.0, Rect 10.0 30.0, Circle 3.0, Circle 4.0]
[Rect 20.0 30.0,Rect 10.0 30.0,Circle 3.0,Circle 4.0]
> 
> map area [Rect 20.0 30.0, Rect 10.0 30.0, Circle 3.0, Circle 4.0]
[600.0,300.0,28.274334,50.265484]
> 

> :t is_rect 
is_rect :: Shape -> Bool
> :t is_circle 
is_circle :: Shape -> Bool
> 

> filter is_rect [Rect 20.0 30.0, Rect 10.0 30.0, Circle 3.0, Circle 4.0]
[Rect 20.0 30.0,Rect 10.0 30.0]

> filter is_circle [Rect 20.0 30.0, Rect 10.0 30.0, Circle 3.0, Circle 4.0]
[Circle 3.0,Circle 4.0]

> :t describe 
describe :: Shape -> IO ()
> 

> describe (Rect 20 30)
Rectangle of 20.0 x 30.0

> describe (Circle 3.60)
Circle of radius : 3.6
> 

> mapM_ describe [Rect 20.0 30.0, Rect 10.0 30.0, Circle 3.0, Circle 4.0]
Rectangle of 20.0 x 30.0
Rectangle of 10.0 x 30.0
Circle of radius : 3.0
Circle of radius : 4.0
> 

> let describe_list = mapM_ describe 
> 
> describe_list [Rect 20.0 30.0, Rect 10.0 30.0, Circle 3.0, Circle 4.0]
Rectangle of 20.0 x 30.0
Rectangle of 10.0 x 30.0
Circle of radius : 3.0
Circle of radius : 4.0
> 

#+END_SRC

