haskell/Algebraic_Data_Types.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Enumerated Data Type</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>Example: Days of Week</b>
</p>

<p>
Enumerated sets is type which can only have a limited number of values. 
</p>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-constructor">Weekday</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Monday</span>
             <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Tuesday</span>
             <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Wednesday</span>
             <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Thursday</span>
             <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Friday</span>
             <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Saturday</span>
             <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Sunday</span>
  <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Ord</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Enum</span>)

<span class="org-function-name">fromDay</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Weekday</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Int</span>
<span class="org-haskell-definition">fromDay</span> <span class="org-haskell-operator">=</span> fromEnum

<span class="org-function-name">toDay</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Weekday</span>
<span class="org-haskell-definition">toDay</span> <span class="org-haskell-operator">=</span> toEnum   

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-constructor">Monday</span><span class="org-haskell-operator">&lt;</span>) [ <span class="org-haskell-constructor">Tuesday</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Friday</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Sunday</span>]
[<span class="org-haskell-constructor">True</span><span class="org-haskell-operator">,</span><span class="org-haskell-constructor">True</span><span class="org-haskell-operator">,</span><span class="org-haskell-constructor">True</span>]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-constructor">Thursday</span><span class="org-haskell-operator">&lt;</span>) [<span class="org-haskell-constructor">Monday</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Tuesday</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Friday</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Sunday</span>]
[<span class="org-haskell-constructor">False</span><span class="org-haskell-operator">,</span><span class="org-haskell-constructor">False</span><span class="org-haskell-operator">,</span><span class="org-haskell-constructor">True</span><span class="org-haskell-operator">,</span><span class="org-haskell-constructor">True</span>]

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Monday</span> <span class="org-haskell-definition">==</span> <span class="org-haskell-constructor">Tuesday</span>
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Tuesday</span> <span class="org-haskell-definition">==</span> <span class="org-haskell-constructor">Tuesday</span>
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span>  

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fromDay</span> <span class="org-haskell-constructor">Saturday</span> 
5

<span class="org-haskell-operator">&gt;</span> 1 <span class="org-haskell-operator">+</span> fromDay <span class="org-haskell-constructor">Monday</span> 
1
<span class="org-haskell-operator">&gt;</span> 1 <span class="org-haskell-operator">+</span> fromDay <span class="org-haskell-constructor">Saturday</span> 
6
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Saturday</span> 
<span class="org-haskell-constructor">Saturday</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">toDay</span> 0
<span class="org-haskell-constructor">Monday</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">toDay</span> 6
<span class="org-haskell-constructor">Sunday</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>Example: Colors</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-constructor">Color</span>
    <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Red</span>
    <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Orange</span>
    <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Yellow</span>
    <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Green</span>
    <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Blue</span>
    <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Purple</span>
    <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">White</span>
    <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Black</span>
    <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">CustomColor</span> <span class="org-haskell-constructor">Int</span> <span class="org-haskell-constructor">Int</span> <span class="org-haskell-constructor">Int</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">R G B components</span>
    <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>)

<span class="org-haskell-definition">colorToRGB</span> <span class="org-haskell-constructor">Red</span>    <span class="org-haskell-operator">=</span> (255<span class="org-haskell-operator">,</span>0<span class="org-haskell-operator">,</span>0)
<span class="org-haskell-definition">colorToRGB</span> <span class="org-haskell-constructor">Orange</span> <span class="org-haskell-operator">=</span> (255<span class="org-haskell-operator">,</span>128<span class="org-haskell-operator">,</span>0)
<span class="org-haskell-definition">colorToRGB</span> <span class="org-haskell-constructor">Yellow</span> <span class="org-haskell-operator">=</span> (255<span class="org-haskell-operator">,</span>255<span class="org-haskell-operator">,</span>0)
<span class="org-haskell-definition">colorToRGB</span> <span class="org-haskell-constructor">Green</span>  <span class="org-haskell-operator">=</span> (0<span class="org-haskell-operator">,</span>255<span class="org-haskell-operator">,</span>0)
<span class="org-haskell-definition">colorToRGB</span> <span class="org-haskell-constructor">Blue</span>   <span class="org-haskell-operator">=</span> (0<span class="org-haskell-operator">,</span>0<span class="org-haskell-operator">,</span>255)
<span class="org-haskell-definition">colorToRGB</span> <span class="org-haskell-constructor">Purple</span> <span class="org-haskell-operator">=</span> (255<span class="org-haskell-operator">,</span>0<span class="org-haskell-operator">,</span>255)
<span class="org-haskell-definition">colorToRGB</span> <span class="org-haskell-constructor">White</span> <span class="org-haskell-operator">=</span> (255<span class="org-haskell-operator">,</span>255<span class="org-haskell-operator">,</span>255)
<span class="org-haskell-definition">colorToRGB</span> <span class="org-haskell-constructor">Black</span> <span class="org-haskell-operator">=</span> (0<span class="org-haskell-operator">,</span>0<span class="org-haskell-operator">,</span>0)
<span class="org-haskell-definition">colorToRGB</span> (<span class="org-haskell-constructor">CustomColor</span> r g b) <span class="org-haskell-operator">=</span> (r<span class="org-haskell-operator">,</span>g<span class="org-haskell-operator">,</span>b)   <span class="org-comment-delimiter">-- </span><span class="org-comment">this one is new</span>
 
    
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Red</span> <span class="org-haskell-definition">==</span> <span class="org-haskell-constructor">White</span>
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Red</span> <span class="org-haskell-definition">==</span> <span class="org-haskell-constructor">Red</span>
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> b <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">CustomColor</span> 120 240 100
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">colorToRGB</span> b
(120<span class="org-haskell-operator">,</span>240<span class="org-haskell-operator">,</span>100)

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> colorToRGB [ <span class="org-haskell-constructor">Blue</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">White</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Yellow</span> ]
[(0<span class="org-haskell-operator">,</span>0<span class="org-haskell-operator">,</span>255)<span class="org-haskell-operator">,</span>(255<span class="org-haskell-operator">,</span>255<span class="org-haskell-operator">,</span>255)<span class="org-haskell-operator">,</span>(255<span class="org-haskell-operator">,</span>255<span class="org-haskell-operator">,</span>0)]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>Example: Shapes</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-constructor">Shape</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Circle</span>  <span class="org-haskell-constructor">Float</span> 
            <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Rect</span>   <span class="org-haskell-constructor">Float</span> <span class="org-haskell-constructor">Float</span> 
            <span class="org-haskell-keyword">deriving</span> <span class="org-haskell-constructor">Show</span>

<span class="org-function-name">square</span>   <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Float</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Shape</span>
<span class="org-haskell-definition">square</span> n <span class="org-haskell-operator">=</span>  <span class="org-haskell-constructor">Rect</span> n n 

<span class="org-function-name">area</span>            <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Shape</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Float</span>
<span class="org-haskell-definition">area</span> (<span class="org-haskell-constructor">Circle</span> r)  <span class="org-haskell-operator">=</span> pi <span class="org-haskell-operator">*</span> r<span class="org-haskell-operator">^</span>2
<span class="org-haskell-definition">area</span> (<span class="org-haskell-constructor">Rect</span> x y)  <span class="org-haskell-operator">=</span> x  <span class="org-haskell-operator">*</span> y

<span class="org-haskell-definition">is_circle</span> (<span class="org-haskell-constructor">Circle</span> <span class="org-haskell-keyword">_</span> ) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">True</span>
<span class="org-haskell-definition">is_circle</span> <span class="org-haskell-keyword">_</span>           <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">False</span>

<span class="org-haskell-definition">is_rect</span>   (<span class="org-haskell-constructor">Rect</span> <span class="org-haskell-keyword">_</span> <span class="org-haskell-keyword">_</span>)  <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">True</span>
<span class="org-haskell-definition">is_rect</span>   <span class="org-haskell-keyword">_</span>           <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">False</span>

<span class="org-haskell-definition">describe</span> (<span class="org-haskell-constructor">Circle</span> radius) <span class="org-haskell-operator">=</span> putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Circle of radius : "</span> <span class="org-haskell-operator">++</span> show(radius) 
<span class="org-haskell-definition">describe</span> (<span class="org-haskell-constructor">Rect</span> h w)      <span class="org-haskell-operator">=</span> putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Rectangle of "</span> <span class="org-haskell-operator">++</span> show(h) <span class="org-haskell-operator">++</span> <span class="org-string">" x "</span> <span class="org-haskell-operator">++</span> show(w)

<span class="org-haskell-operator">&gt;</span> area <span class="org-haskell-definition">$</span>  <span class="org-haskell-constructor">Rect</span> 20 30
600.0
<span class="org-haskell-operator">&gt;</span> area <span class="org-haskell-definition">$</span> <span class="org-haskell-constructor">Circle</span> 20
1256.6371
<span class="org-haskell-operator">&gt;</span> area <span class="org-haskell-definition">$</span> square 20
400.0
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> [<span class="org-haskell-constructor">Rect</span> 20.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Rect</span> 10.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 3.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 4.0]
[<span class="org-haskell-constructor">Rect</span> 20.0 30.0<span class="org-haskell-operator">,</span><span class="org-haskell-constructor">Rect</span> 10.0 30.0<span class="org-haskell-operator">,</span><span class="org-haskell-constructor">Circle</span> 3.0<span class="org-haskell-operator">,</span><span class="org-haskell-constructor">Circle</span> 4.0]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> area [<span class="org-haskell-constructor">Rect</span> 20.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Rect</span> 10.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 3.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 4.0]
[600.0<span class="org-haskell-operator">,</span>300.0<span class="org-haskell-operator">,</span>28.274334<span class="org-haskell-operator">,</span>50.265484]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t is_rect 
<span class="org-function-name">is_rect</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Shape</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Bool</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t is_circle 
<span class="org-function-name">is_circle</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Shape</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Bool</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> is_rect [<span class="org-haskell-constructor">Rect</span> 20.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Rect</span> 10.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 3.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 4.0]
[<span class="org-haskell-constructor">Rect</span> 20.0 30.0<span class="org-haskell-operator">,</span><span class="org-haskell-constructor">Rect</span> 10.0 30.0]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> is_circle [<span class="org-haskell-constructor">Rect</span> 20.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Rect</span> 10.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 3.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 4.0]
[<span class="org-haskell-constructor">Circle</span> 3.0<span class="org-haskell-operator">,</span><span class="org-haskell-constructor">Circle</span> 4.0]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t describe 
<span class="org-function-name">describe</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Shape</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">describe</span> (<span class="org-haskell-constructor">Rect</span> 20 30)
<span class="org-haskell-constructor">Rectangle</span> <span class="org-haskell-keyword">of</span> 20.0 x 30.0

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">describe</span> (<span class="org-haskell-constructor">Circle</span> 3.60)
<span class="org-haskell-constructor">Circle</span> <span class="org-haskell-keyword">of</span> radius <span class="org-haskell-constructor">:</span> 3.6
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> describe [<span class="org-haskell-constructor">Rect</span> 20.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Rect</span> 10.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 3.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 4.0]
<span class="org-haskell-constructor">Rectangle</span> <span class="org-haskell-keyword">of</span> 20.0 x 30.0
<span class="org-haskell-constructor">Rectangle</span> <span class="org-haskell-keyword">of</span> 10.0 x 30.0
<span class="org-haskell-constructor">Circle</span> <span class="org-haskell-keyword">of</span> radius <span class="org-haskell-constructor">:</span> 3.0
<span class="org-haskell-constructor">Circle</span> <span class="org-haskell-keyword">of</span> radius <span class="org-haskell-constructor">:</span> 4.0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> describe_list <span class="org-haskell-operator">=</span> mapM_ describe 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">describe_list</span> [<span class="org-haskell-constructor">Rect</span> 20.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Rect</span> 10.0 30.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 3.0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Circle</span> 4.0]
<span class="org-haskell-constructor">Rectangle</span> <span class="org-haskell-keyword">of</span> 20.0 x 30.0
<span class="org-haskell-constructor">Rectangle</span> <span class="org-haskell-keyword">of</span> 10.0 x 30.0
<span class="org-haskell-constructor">Circle</span> <span class="org-haskell-keyword">of</span> radius <span class="org-haskell-constructor">:</span> 3.0
<span class="org-haskell-constructor">Circle</span> <span class="org-haskell-keyword">of</span> radius <span class="org-haskell-constructor">:</span> 4.0
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
