haskell/Algebraic_Data_Types.org
** Typeclass without Record Syntax

*Example: Students GPA*

#+BEGIN_SRC haskell

data Student = USU String Float 
             deriving (Show)

get_gpa :: Student -> Float
get_gpa (USU _ grade) = grade

get_name :: Student -> String
get_name (USU name _ ) = name

class_gpa :: [Student] -> Float
class_gpa myclass = (sum c) / fromIntegral  (length c)
                  where 
                  c = map get_gpa myclass


> let myke = USU "Mike" 4.0
>  
>  get_name myke
"Mike"
>  get_gpa myke
4.0
>  

>  let myclass = [USU "Mike" 3.7, USU "Steve" 3.9, USU "Fred" 2.9, USU "Joe" 1.5]
>  

>  class_gpa myclass 
3.0
#+END_SRC

