haskell/Algebraic_Data_Types.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Typeclass without Record Syntax</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>Example: Students GPA</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-constructor">Student</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">USU</span> <span class="org-haskell-constructor">String</span> <span class="org-haskell-constructor">Float</span> 
             <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Show</span>)

<span class="org-function-name">get_gpa</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Student</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Float</span>
<span class="org-haskell-definition">get_gpa</span> (<span class="org-haskell-constructor">USU</span> <span class="org-haskell-keyword">_</span> grade) <span class="org-haskell-operator">=</span> grade

<span class="org-function-name">get_name</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Student</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">String</span>
<span class="org-haskell-definition">get_name</span> (<span class="org-haskell-constructor">USU</span> name <span class="org-haskell-keyword">_</span> ) <span class="org-haskell-operator">=</span> name

<span class="org-function-name">class_gpa</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-constructor">Student</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Float</span>
<span class="org-haskell-definition">class_gpa</span> myclass <span class="org-haskell-operator">=</span> (sum c) <span class="org-haskell-operator">/</span> fromIntegral  (length c)
                  <span class="org-haskell-keyword">where</span> 
                  c <span class="org-haskell-operator">=</span> map get_gpa myclass


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> myke <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">USU</span> <span class="org-string">"Mike"</span> 4.0
<span class="org-haskell-operator">&gt;</span>  
<span class="org-haskell-operator">&gt;</span>  get_name myke
<span class="org-string">"Mike"</span>
<span class="org-haskell-operator">&gt;</span>  get_gpa myke
4.0
<span class="org-haskell-operator">&gt;</span>  

<span class="org-haskell-operator">&gt;</span>  <span class="org-haskell-keyword">let</span> myclass <span class="org-haskell-operator">=</span> [<span class="org-haskell-constructor">USU</span> <span class="org-string">"Mike"</span> 3.7<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">USU</span> <span class="org-string">"Steve"</span> 3.9<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">USU</span> <span class="org-string">"Fred"</span> 2.9<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">USU</span> <span class="org-string">"Joe"</span> 1.5]
<span class="org-haskell-operator">&gt;</span>  

<span class="org-haskell-operator">&gt;</span>  class_gpa myclass 
3.0
</pre>
</div>
</div>
</div>
