haskell/Algebraic_Data_Types.org
** Record Syntax

*Example: Typeclass with record Syntax*

#+BEGIN_SRC haskell

data Person = Person { firstName :: String, 
                       lastName :: String, 
                       age :: Int 
                     }
                     deriving (Eq, Show, Read)


people = [ Person { firstName = "Ayn",  lastName = "Rand",  age =50},
           Person { firstName = "John", lastName = "Galt",  age =28},
           Person { firstName = "Adam", lastName = "Smith", age =70}]


{- Get someone from the people database -}
getPerson n = people !! n

{- Show Person -}
showPerson :: Person -> String
showPerson person  = "Name: " ++ show(firstName person) ++ " - Last Name: " ++ show(lastName person) ++ " - Age " ++ show(age person) 

> people
[Person {firstName = "Ayn", lastName = "Rand", age = 50},Person {firstName = "John", lastName = "Galt", age = 28},Person {firstName = "Adam", lastName = "Smith", age = 70}]
> 

> map firstName people
["Ayn","John","Adam"]
> 

> map (\el ->  fst el ++ " " ++  snd el) $ zip (map firstName people) (map lastName people)
>  ["Ayn Rand","John Galt","Adam Smith"]


> people !! 1
Person {firstName = "John", lastName = "Galt", age = 28}
> people !! 2
Person {firstName = "Adam", lastName = "Smith", age = 70}
> 

> "person 0 is " ++ show (people !! 0)
"person 0 is Person {firstName = \"Ayn\", lastName = \"Rand\", age = 50}"
> 
> "person 1 is " ++ show (people !! 1)
"person 1 is Person {firstName = \"John\", lastName = \"Galt\", age = 28}"
>


> let person = read "Person {firstName =\"Elmo\", lastName =\"NA\", age = 0}" :: Person
> person
Person {firstName = "Elmo", lastName = "NA", age = 0}
> 
> firstName person 
"Elmo"
> last
last      lastName
> lastName person 
"NA"
> age person
0
> 

> let tesla = Person { firstName = "Nikola", lastName = "Tesla", age =30}
> tesla
Person {firstName = "Nikola", lastName = "Tesla", age = 30}
> 

> showPerson tesla
"Name: \"Nikola\" - Last Name: \"Tesla\" - Age 30"
> 

#+END_SRC

