haskell/Algebraic_Data_Types.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Record Syntax</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>Example: Typeclass with record Syntax</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-constructor">Person</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Person</span> { firstName <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">String</span><span class="org-haskell-operator">,</span> 
                       lastName <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">String</span><span class="org-haskell-operator">,</span> 
                       age <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Int</span> 
                     }
                     <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Show</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Read</span>)


<span class="org-haskell-definition">people</span> <span class="org-haskell-operator">=</span> [ <span class="org-haskell-constructor">Person</span> { firstName <span class="org-haskell-operator">=</span> <span class="org-string">"Ayn"</span><span class="org-haskell-operator">,</span>  lastName <span class="org-haskell-operator">=</span> <span class="org-string">"Rand"</span><span class="org-haskell-operator">,</span>  age <span class="org-haskell-operator">=</span>50}<span class="org-haskell-operator">,</span>
           <span class="org-haskell-constructor">Person</span> { firstName <span class="org-haskell-operator">=</span> <span class="org-string">"John"</span><span class="org-haskell-operator">,</span> lastName <span class="org-haskell-operator">=</span> <span class="org-string">"Galt"</span><span class="org-haskell-operator">,</span>  age <span class="org-haskell-operator">=</span>28}<span class="org-haskell-operator">,</span>
           <span class="org-haskell-constructor">Person</span> { firstName <span class="org-haskell-operator">=</span> <span class="org-string">"Adam"</span><span class="org-haskell-operator">,</span> lastName <span class="org-haskell-operator">=</span> <span class="org-string">"Smith"</span><span class="org-haskell-operator">,</span> age <span class="org-haskell-operator">=</span>70}]


<span class="org-comment-delimiter">{- </span><span class="org-comment">Get someone from the people database -}</span>
<span class="org-haskell-definition">getPerson</span> n <span class="org-haskell-operator">=</span> people <span class="org-haskell-operator">!!</span> n

<span class="org-comment-delimiter">{- </span><span class="org-comment">Show Person -}</span>
<span class="org-function-name">showPerson</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Person</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">String</span>
<span class="org-haskell-definition">showPerson</span> person  <span class="org-haskell-operator">=</span> <span class="org-string">"Name: "</span> <span class="org-haskell-operator">++</span> show(firstName person) <span class="org-haskell-operator">++</span> <span class="org-string">" - Last Name: "</span> <span class="org-haskell-operator">++</span> show(lastName person) <span class="org-haskell-operator">++</span> <span class="org-string">" - Age "</span> <span class="org-haskell-operator">++</span> show(age person) 

<span class="org-haskell-operator">&gt;</span> people
[<span class="org-haskell-constructor">Person</span> {firstName <span class="org-haskell-operator">=</span> <span class="org-string">"Ayn"</span><span class="org-haskell-operator">,</span> lastName <span class="org-haskell-operator">=</span> <span class="org-string">"Rand"</span><span class="org-haskell-operator">,</span> age <span class="org-haskell-operator">=</span> 50}<span class="org-haskell-operator">,</span><span class="org-haskell-constructor">Person</span> {firstName <span class="org-haskell-operator">=</span> <span class="org-string">"John"</span><span class="org-haskell-operator">,</span> lastName <span class="org-haskell-operator">=</span> <span class="org-string">"Galt"</span><span class="org-haskell-operator">,</span> age <span class="org-haskell-operator">=</span> 28}<span class="org-haskell-operator">,</span><span class="org-haskell-constructor">Person</span> {firstName <span class="org-haskell-operator">=</span> <span class="org-string">"Adam"</span><span class="org-haskell-operator">,</span> lastName <span class="org-haskell-operator">=</span> <span class="org-string">"Smith"</span><span class="org-haskell-operator">,</span> age <span class="org-haskell-operator">=</span> 70}]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> firstName people
[<span class="org-string">"Ayn"</span><span class="org-haskell-operator">,</span><span class="org-string">"John"</span><span class="org-haskell-operator">,</span><span class="org-string">"Adam"</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">\</span>el <span class="org-haskell-operator">-&gt;</span>  fst el <span class="org-haskell-operator">++</span> <span class="org-string">" "</span> <span class="org-haskell-operator">++</span>  snd el) <span class="org-haskell-operator">$</span> zip (map firstName people) (map lastName people)
<span class="org-haskell-operator">&gt;</span>  [<span class="org-string">"Ayn Rand"</span><span class="org-haskell-operator">,</span><span class="org-string">"John Galt"</span><span class="org-haskell-operator">,</span><span class="org-string">"Adam Smith"</span>]


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">people</span> <span class="org-haskell-definition">!!</span> 1
<span class="org-haskell-constructor">Person</span> {firstName <span class="org-haskell-operator">=</span> <span class="org-string">"John"</span><span class="org-haskell-operator">,</span> lastName <span class="org-haskell-operator">=</span> <span class="org-string">"Galt"</span><span class="org-haskell-operator">,</span> age <span class="org-haskell-operator">=</span> 28}
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">people</span> <span class="org-haskell-definition">!!</span> 2
<span class="org-haskell-constructor">Person</span> {firstName <span class="org-haskell-operator">=</span> <span class="org-string">"Adam"</span><span class="org-haskell-operator">,</span> lastName <span class="org-haskell-operator">=</span> <span class="org-string">"Smith"</span><span class="org-haskell-operator">,</span> age <span class="org-haskell-operator">=</span> 70}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-string">"person 0 is "</span> <span class="org-haskell-operator">++</span> show (people <span class="org-haskell-operator">!!</span> 0)
<span class="org-string">"person 0 is Person {firstName = \"Ayn\", lastName = \"Rand\", age = 50}"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-string">"person 1 is "</span> <span class="org-haskell-operator">++</span> show (people <span class="org-haskell-operator">!!</span> 1)
<span class="org-string">"person 1 is Person {firstName = \"John\", lastName = \"Galt\", age = 28}"</span>
<span class="org-haskell-operator">&gt;</span>


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> person <span class="org-haskell-operator">=</span> read <span class="org-string">"Person {firstName =\"Elmo\", lastName =\"NA\", age = 0}"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">Person</span>
<span class="org-haskell-operator">&gt;</span> person
<span class="org-haskell-constructor">Person</span> {firstName <span class="org-haskell-operator">=</span> <span class="org-string">"Elmo"</span><span class="org-haskell-operator">,</span> lastName <span class="org-haskell-operator">=</span> <span class="org-string">"NA"</span><span class="org-haskell-operator">,</span> age <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">firstName</span> person 
<span class="org-string">"Elmo"</span>
<span class="org-haskell-operator">&gt;</span> last
<span class="org-haskell-definition">last</span>      lastName
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">lastName</span> person 
<span class="org-string">"NA"</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">age</span> person
0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> tesla <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Person</span> { firstName <span class="org-haskell-operator">=</span> <span class="org-string">"Nikola"</span><span class="org-haskell-operator">,</span> lastName <span class="org-haskell-operator">=</span> <span class="org-string">"Tesla"</span><span class="org-haskell-operator">,</span> age <span class="org-haskell-operator">=</span>30}
<span class="org-haskell-operator">&gt;</span> tesla
<span class="org-haskell-constructor">Person</span> {firstName <span class="org-haskell-operator">=</span> <span class="org-string">"Nikola"</span><span class="org-haskell-operator">,</span> lastName <span class="org-haskell-operator">=</span> <span class="org-string">"Tesla"</span><span class="org-haskell-operator">,</span> age <span class="org-haskell-operator">=</span> 30}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">showPerson</span> tesla
<span class="org-string">"Name: \"Nikola\" - Last Name: \"Tesla\" - Age 30"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
