haskell/Algebraic_Data_Types.html

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Recursive Data Types</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<b>Exmple: Custom List Implementation</b>
</p>


<p>
File: list_cons.hs
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-constructor">List</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nil</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Cons</span> a (<span class="org-haskell-constructor">List</span> a) <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Show</span>)

<span class="org-function-name">is_empty</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> t <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Bool</span>
<span class="org-haskell-definition">is_empty</span> <span class="org-haskell-constructor">Nil</span> <span class="org-haskell-operator">=</span>  <span class="org-haskell-constructor">True</span>
<span class="org-haskell-definition">is_empty</span> <span class="org-haskell-keyword">_</span>   <span class="org-haskell-operator">=</span>  <span class="org-haskell-constructor">False</span>

<span class="org-haskell-definition">is_empty2</span>  lst <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">case</span> lst <span class="org-haskell-keyword">of</span> 
                    <span class="org-haskell-constructor">Nil</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">True</span>
                    <span class="org-haskell-keyword">_</span>   <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">False</span>

<span class="org-function-name">count</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> t <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Int</span>
<span class="org-haskell-definition">count</span> lst <span class="org-haskell-operator">=</span> 
    <span class="org-haskell-keyword">case</span> lst <span class="org-haskell-keyword">of</span> 
        <span class="org-haskell-constructor">Nil</span>             <span class="org-haskell-operator">-&gt;</span> 0
        <span class="org-haskell-constructor">Cons</span> a next_lst <span class="org-haskell-operator">-&gt;</span> 1 <span class="org-haskell-operator">+</span> count next_lst

<span class="org-haskell-definition">suml</span> lst <span class="org-haskell-operator">=</span> 
    <span class="org-haskell-keyword">case</span> lst <span class="org-haskell-keyword">of</span>
        <span class="org-haskell-constructor">Nil</span>             <span class="org-haskell-operator">-&gt;</span> 0
        <span class="org-haskell-constructor">Cons</span> a next_lst <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">+</span> suml next_lst
        
<span class="org-haskell-definition">headl</span> (<span class="org-haskell-constructor">Cons</span> a <span class="org-haskell-keyword">_</span>) <span class="org-haskell-operator">=</span> a
<span class="org-haskell-definition">headl</span> <span class="org-haskell-constructor">Nil</span>        <span class="org-haskell-operator">=</span> error <span class="org-string">"Empty List"</span>

<span class="org-haskell-definition">safe_headl</span> (<span class="org-haskell-constructor">Cons</span> a <span class="org-haskell-keyword">_</span>) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> a
<span class="org-haskell-definition">safe_headl</span> <span class="org-haskell-constructor">Nil</span>        <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>

<span class="org-haskell-definition">lastl</span> <span class="org-haskell-constructor">Nil</span>           <span class="org-haskell-operator">=</span> error <span class="org-string">"Failed: Empty List"</span>
<span class="org-haskell-definition">lastl</span> (<span class="org-haskell-constructor">Cons</span> a <span class="org-haskell-constructor">Nil</span>)  <span class="org-haskell-operator">=</span> a
<span class="org-haskell-definition">lastl</span> (<span class="org-haskell-constructor">Cons</span> <span class="org-haskell-keyword">_</span> t)    <span class="org-haskell-operator">=</span> lastl t

<span class="org-comment-delimiter">{- </span><span class="org-comment">Converts to Haskell List -}</span>
<span class="org-haskell-definition">to_list</span> <span class="org-haskell-constructor">Nil</span>         <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">[]</span>
<span class="org-haskell-definition">to_list</span> (<span class="org-haskell-constructor">Cons</span> x xs) <span class="org-haskell-operator">=</span> x<span class="org-haskell-constructor">:</span>(to_list xs)


<span class="org-haskell-definition">takel</span> n lst <span class="org-haskell-operator">=</span>
    <span class="org-haskell-keyword">case</span> (n<span class="org-haskell-operator">,</span> lst) <span class="org-haskell-keyword">of</span>
    (<span class="org-haskell-keyword">_</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Nil</span>      )  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Nil</span>
    (0<span class="org-haskell-operator">,</span> <span class="org-haskell-keyword">_</span>        )  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Nil</span>
    (k<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Cons</span> h  t)  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Cons</span> h (takel (n<span class="org-haskell-operator">-</span>1) t)


<span class="org-haskell-definition">nth</span> lst n <span class="org-haskell-operator">=</span> 
    <span class="org-haskell-keyword">case</span> (n<span class="org-haskell-operator">,</span> lst) <span class="org-haskell-keyword">of</span>
    (<span class="org-haskell-keyword">_</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Nil</span>)       <span class="org-haskell-operator">-&gt;</span> error <span class="org-string">"Index too large"</span>
    (0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Cons</span> a <span class="org-haskell-keyword">_</span>)  <span class="org-haskell-operator">-&gt;</span> a
    (k<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Cons</span> h t)  <span class="org-haskell-operator">-&gt;</span> nth t (n<span class="org-haskell-operator">-</span>1) 


<span class="org-haskell-definition">mapl</span> f <span class="org-haskell-constructor">Nil</span>          <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-definition">mapl</span> f (<span class="org-haskell-constructor">Cons</span> h t)   <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> (f h) (mapl f t)

<span class="org-haskell-definition">filterl</span>  f  <span class="org-haskell-constructor">Nil</span>        <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-definition">filterl</span>  f (<span class="org-haskell-constructor">Cons</span> h t)  <span class="org-haskell-operator">=</span> 
    <span class="org-haskell-keyword">if</span> f h 
        <span class="org-haskell-keyword">then</span>  <span class="org-haskell-constructor">Cons</span> h (filterl f t)
        <span class="org-haskell-keyword">else</span>  filterl f t

<span class="org-comment-delimiter">{- </span><span class="org-comment">Empty List [] -}</span>
<span class="org-haskell-definition">list0</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nil</span>

<span class="org-comment-delimiter">{- </span><span class="org-comment">Sigle element list -}</span>
<span class="org-haskell-definition">list1</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> 10 <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-definition">list2</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> <span class="org-string">"Haskell"</span> <span class="org-haskell-constructor">Nil</span>

<span class="org-haskell-definition">list3</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> 10 (<span class="org-haskell-constructor">Cons</span> 20 (<span class="org-haskell-constructor">Cons</span> 30 <span class="org-haskell-constructor">Nil</span>))
<span class="org-haskell-definition">list4</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> 1.25 (<span class="org-haskell-constructor">Cons</span> 0.65 (<span class="org-haskell-constructor">Cons</span> 8.123 ( <span class="org-haskell-constructor">Cons</span> 9.434 <span class="org-haskell-constructor">Nil</span>)))
</pre>
</div>

<p>
Running in ghci
</p>
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>l list_cons<span class="org-haskell-operator">.</span>hs 
[1 <span class="org-haskell-keyword">of</span> 1] <span class="org-haskell-constructor">Compiling</span> <span class="org-haskell-constructor">Main</span>             ( list_cons<span class="org-haskell-operator">.</span>hs<span class="org-haskell-operator">,</span> interpreted )
<span class="org-haskell-constructor">Ok</span><span class="org-haskell-operator">,</span> modules loaded<span class="org-haskell-constructor">:</span> <span class="org-haskell-constructor">Main</span><span class="org-haskell-operator">.</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t is_empty
<span class="org-function-name">is_empty</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> t <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Bool</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t count 
<span class="org-function-name">count</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> t <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Int</span>


<span class="org-haskell-operator">&gt;</span> list0
<span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> list1
<span class="org-haskell-constructor">Cons</span> 10 <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> list2
<span class="org-haskell-constructor">Cons</span> <span class="org-string">"Haskell"</span> <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> list3
<span class="org-haskell-constructor">Cons</span> 10 (<span class="org-haskell-constructor">Cons</span> 20 (<span class="org-haskell-constructor">Cons</span> 30 <span class="org-haskell-constructor">Nil</span>))
<span class="org-haskell-operator">&gt;</span> list4
<span class="org-haskell-constructor">Cons</span> 1.25 (<span class="org-haskell-constructor">Cons</span> 0.65 (<span class="org-haskell-constructor">Cons</span> 8.123 (<span class="org-haskell-constructor">Cons</span> 9.434 <span class="org-haskell-constructor">Nil</span>)))

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t list0
<span class="org-function-name">list0</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> a
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t list1
<span class="org-function-name">list1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> <span class="org-haskell-constructor">Integer</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t list2
<span class="org-function-name">list2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Char</span>]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t list3
<span class="org-function-name">list3</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> <span class="org-haskell-constructor">Integer</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t list4
<span class="org-function-name">list4</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> <span class="org-haskell-constructor">Double</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Cons</span> 10.23 list0
<span class="org-haskell-constructor">Cons</span> 10.23 <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Cons</span> 30 list1
<span class="org-haskell-constructor">Cons</span> 30 (<span class="org-haskell-constructor">Cons</span> 10 <span class="org-haskell-constructor">Nil</span>)
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Cons</span> 40 list3
<span class="org-haskell-constructor">Cons</span> 40 (<span class="org-haskell-constructor">Cons</span> 10 (<span class="org-haskell-constructor">Cons</span> 20 (<span class="org-haskell-constructor">Cons</span> 30 <span class="org-haskell-constructor">Nil</span>)))
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Cons</span> 50 (<span class="org-haskell-constructor">Cons</span> 40 list3)
<span class="org-haskell-constructor">Cons</span> 50 (<span class="org-haskell-constructor">Cons</span> 40 (<span class="org-haskell-constructor">Cons</span> 10 (<span class="org-haskell-constructor">Cons</span> 20 (<span class="org-haskell-constructor">Cons</span> 30 <span class="org-haskell-constructor">Nil</span>))))


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty</span> list0
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty</span> list1
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty</span> list2
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty</span> list3
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty2</span> list0
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty2</span> list1
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty2</span> list3
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">count</span> list0
0
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">count</span> list1
1
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">count</span> list2
1
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">count</span> list3
3

<span class="org-comment-delimiter">{- </span><span class="org-comment">Getting the first element -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">headl</span> list0

<span class="org-haskell-operator">*</span><span class="org-haskell-constructor">Example:</span> <span class="org-haskell-constructor">Custom</span> <span class="org-haskell-constructor">List</span> <span class="org-haskell-constructor">Implementation</span><span class="org-haskell-operator">*</span>

<span class="org-function-name">File</span><span class="org-haskell-definition">:</span> list_cons<span class="org-haskell-operator">.</span>hs

<span class="org-preprocessor">#+BEGIN_SRC haskell</span>

<span class="org-haskell-keyword">data</span> <span class="org-haskell-constructor">List</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nil</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Cons</span> a (<span class="org-haskell-constructor">List</span> a) <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Show</span>)

<span class="org-function-name">is_empty</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> t <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Bool</span>
<span class="org-haskell-definition">is_empty</span> <span class="org-haskell-constructor">Nil</span> <span class="org-haskell-operator">=</span>  <span class="org-haskell-constructor">True</span>
<span class="org-haskell-definition">is_empty</span> <span class="org-haskell-keyword">_</span>   <span class="org-haskell-operator">=</span>  <span class="org-haskell-constructor">False</span>

<span class="org-haskell-definition">is_empty2</span>  lst <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">case</span> lst <span class="org-haskell-keyword">of</span> 
                    <span class="org-haskell-constructor">Nil</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">True</span>
                    <span class="org-haskell-keyword">_</span>   <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">False</span>

<span class="org-function-name">count</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> t <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Int</span>
<span class="org-haskell-definition">count</span> lst <span class="org-haskell-operator">=</span> 
    <span class="org-haskell-keyword">case</span> lst <span class="org-haskell-keyword">of</span> 
        <span class="org-haskell-constructor">Nil</span>             <span class="org-haskell-operator">-&gt;</span> 0
        <span class="org-haskell-constructor">Cons</span> a next_lst <span class="org-haskell-operator">-&gt;</span> 1 <span class="org-haskell-operator">+</span> count next_lst

<span class="org-haskell-definition">suml</span> lst <span class="org-haskell-operator">=</span> 
    <span class="org-haskell-keyword">case</span> lst <span class="org-haskell-keyword">of</span>
        <span class="org-haskell-constructor">Nil</span>             <span class="org-haskell-operator">-&gt;</span> 0
        <span class="org-haskell-constructor">Cons</span> a next_lst <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">+</span> suml next_lst
        
<span class="org-haskell-definition">headl</span> (<span class="org-haskell-constructor">Cons</span> a <span class="org-haskell-keyword">_</span>) <span class="org-haskell-operator">=</span> a
<span class="org-haskell-definition">headl</span> <span class="org-haskell-constructor">Nil</span>        <span class="org-haskell-operator">=</span> error <span class="org-string">"Empty List"</span>

<span class="org-haskell-definition">safe_headl</span> (<span class="org-haskell-constructor">Cons</span> a <span class="org-haskell-keyword">_</span>) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> a
<span class="org-haskell-definition">safe_headl</span> <span class="org-haskell-constructor">Nil</span>        <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>

<span class="org-haskell-definition">lastl</span> <span class="org-haskell-constructor">Nil</span>           <span class="org-haskell-operator">=</span> error <span class="org-string">"Failed: Empty List"</span>
<span class="org-haskell-definition">lastl</span> (<span class="org-haskell-constructor">Cons</span> a <span class="org-haskell-constructor">Nil</span>)  <span class="org-haskell-operator">=</span> a
<span class="org-haskell-definition">lastl</span> (<span class="org-haskell-constructor">Cons</span> <span class="org-haskell-keyword">_</span> t)    <span class="org-haskell-operator">=</span> lastl t

<span class="org-comment-delimiter">{- </span><span class="org-comment">Converts to Haskell List -}</span>
<span class="org-haskell-definition">to_list</span> <span class="org-haskell-constructor">Nil</span>         <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">[]</span>
<span class="org-haskell-definition">to_list</span> (<span class="org-haskell-constructor">Cons</span> x xs) <span class="org-haskell-operator">=</span> x<span class="org-haskell-constructor">:</span>(to_list xs)


<span class="org-haskell-definition">takel</span> n lst <span class="org-haskell-operator">=</span>
    <span class="org-haskell-keyword">case</span> (n<span class="org-haskell-operator">,</span> lst) <span class="org-haskell-keyword">of</span>
    (<span class="org-haskell-keyword">_</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Nil</span>      )  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Nil</span>
    (0<span class="org-haskell-operator">,</span> <span class="org-haskell-keyword">_</span>        )  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Nil</span>
    (k<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Cons</span> h  t)  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Cons</span> h (takel (n<span class="org-haskell-operator">-</span>1) t)


<span class="org-haskell-definition">nth</span> lst n <span class="org-haskell-operator">=</span> 
    <span class="org-haskell-keyword">case</span> (n<span class="org-haskell-operator">,</span> lst) <span class="org-haskell-keyword">of</span>
    (<span class="org-haskell-keyword">_</span><span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Nil</span>)       <span class="org-haskell-operator">-&gt;</span> error <span class="org-string">"Index too large"</span>
    (0<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Cons</span> a <span class="org-haskell-keyword">_</span>)  <span class="org-haskell-operator">-&gt;</span> a
    (k<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Cons</span> h t)  <span class="org-haskell-operator">-&gt;</span> nth t (n<span class="org-haskell-operator">-</span>1) 


<span class="org-haskell-definition">mapl</span> f <span class="org-haskell-constructor">Nil</span>          <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-definition">mapl</span> f (<span class="org-haskell-constructor">Cons</span> h t)   <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> (f h) (mapl f t)

<span class="org-haskell-definition">filterl</span>  f  <span class="org-haskell-constructor">Nil</span>        <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-definition">filterl</span>  f (<span class="org-haskell-constructor">Cons</span> h t)  <span class="org-haskell-operator">=</span> 
    <span class="org-haskell-keyword">if</span> f h 
        <span class="org-haskell-keyword">then</span>  <span class="org-haskell-constructor">Cons</span> h (filterl f t)
        <span class="org-haskell-keyword">else</span>  filterl f t

<span class="org-comment-delimiter">{- </span><span class="org-comment">Empty List [] -}</span>
<span class="org-haskell-definition">list0</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nil</span>

<span class="org-comment-delimiter">{- </span><span class="org-comment">Sigle element list -}</span>
<span class="org-haskell-definition">list1</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> 10 <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-definition">list2</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> <span class="org-string">"Haskell"</span> <span class="org-haskell-constructor">Nil</span>

<span class="org-haskell-definition">list3</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> 10 (<span class="org-haskell-constructor">Cons</span> 20 (<span class="org-haskell-constructor">Cons</span> 30 <span class="org-haskell-constructor">Nil</span>))
<span class="org-haskell-definition">list4</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> 1.25 (<span class="org-haskell-constructor">Cons</span> 0.65 (<span class="org-haskell-constructor">Cons</span> 8.123 ( <span class="org-haskell-constructor">Cons</span> 9.434 <span class="org-haskell-constructor">Nil</span>)))
```

<span class="org-haskell-constructor">Running</span> <span class="org-haskell-keyword">in</span> ghci
```haskell

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>l list_cons<span class="org-haskell-operator">.</span>hs 
[1 <span class="org-haskell-keyword">of</span> 1] <span class="org-haskell-constructor">Compiling</span> <span class="org-haskell-constructor">Main</span>             ( list_cons<span class="org-haskell-operator">.</span>hs<span class="org-haskell-operator">,</span> interpreted )
<span class="org-haskell-constructor">Ok</span><span class="org-haskell-operator">,</span> modules loaded<span class="org-haskell-constructor">:</span> <span class="org-haskell-constructor">Main</span><span class="org-haskell-operator">.</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t is_empty
<span class="org-function-name">is_empty</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> t <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Bool</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t count 
<span class="org-function-name">count</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> t <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Int</span>


<span class="org-haskell-operator">&gt;</span> list0
<span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> list1
<span class="org-haskell-constructor">Cons</span> 10 <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> list2
<span class="org-haskell-constructor">Cons</span> <span class="org-string">"Haskell"</span> <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> list3
<span class="org-haskell-constructor">Cons</span> 10 (<span class="org-haskell-constructor">Cons</span> 20 (<span class="org-haskell-constructor">Cons</span> 30 <span class="org-haskell-constructor">Nil</span>))
<span class="org-haskell-operator">&gt;</span> list4
<span class="org-haskell-constructor">Cons</span> 1.25 (<span class="org-haskell-constructor">Cons</span> 0.65 (<span class="org-haskell-constructor">Cons</span> 8.123 (<span class="org-haskell-constructor">Cons</span> 9.434 <span class="org-haskell-constructor">Nil</span>)))

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t list0
<span class="org-function-name">list0</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> a
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t list1
<span class="org-function-name">list1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> <span class="org-haskell-constructor">Integer</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t list2
<span class="org-function-name">list2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Char</span>]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t list3
<span class="org-function-name">list3</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> <span class="org-haskell-constructor">Integer</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t list4
<span class="org-function-name">list4</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> <span class="org-haskell-constructor">Double</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Cons</span> 10.23 list0
<span class="org-haskell-constructor">Cons</span> 10.23 <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Cons</span> 30 list1
<span class="org-haskell-constructor">Cons</span> 30 (<span class="org-haskell-constructor">Cons</span> 10 <span class="org-haskell-constructor">Nil</span>)
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Cons</span> 40 list3
<span class="org-haskell-constructor">Cons</span> 40 (<span class="org-haskell-constructor">Cons</span> 10 (<span class="org-haskell-constructor">Cons</span> 20 (<span class="org-haskell-constructor">Cons</span> 30 <span class="org-haskell-constructor">Nil</span>)))
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Cons</span> 50 (<span class="org-haskell-constructor">Cons</span> 40 list3)
<span class="org-haskell-constructor">Cons</span> 50 (<span class="org-haskell-constructor">Cons</span> 40 (<span class="org-haskell-constructor">Cons</span> 10 (<span class="org-haskell-constructor">Cons</span> 20 (<span class="org-haskell-constructor">Cons</span> 30 <span class="org-haskell-constructor">Nil</span>))))


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty</span> list0
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty</span> list1
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty</span> list2
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty</span> list3
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty2</span> list0
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty2</span> list1
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">is_empty2</span> list3
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">count</span> list0
0
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">count</span> list1
1
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">count</span> list2
1
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">count</span> list3
3

<span class="org-comment-delimiter">{- </span><span class="org-comment">Getting the first element -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">headl</span> list0
 <span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">Empty</span> <span class="org-haskell-constructor">List</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">headl</span> list1
10
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">headl</span> list2
<span class="org-string">"Haskell"</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">headl</span> list3
10
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">headl</span> list4
1.25
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Safe version of headl -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">safe_headl</span> list0
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">safe_headl</span> list1
<span class="org-haskell-constructor">Just</span> 10
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">safe_headl</span> list2
<span class="org-haskell-constructor">Just</span> <span class="org-string">"Haskell"</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">safe_headl</span> list3
<span class="org-haskell-constructor">Just</span> 10
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">safe_headl</span> list4
<span class="org-haskell-constructor">Just</span> 1.25
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t safe_headl 
<span class="org-function-name">safe_headl</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Maybe</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Getting the last element -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">lastl</span> list0

 <span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">Failed:</span> <span class="org-haskell-constructor">Empty</span> <span class="org-haskell-constructor">List</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">lastl</span> list1
10
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">lastl</span> list2
<span class="org-string">"Haskell"</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">lastl</span> list3
30
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">lastl</span> list4
9.434
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Converting to Standard Haskell List -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">to_list</span> list0
<span class="org-haskell-constructor">[]</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">to_list</span> list1
 [ 10 ]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">to_list</span> list2
[<span class="org-string">"Haskell"</span>]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">to_list</span> list3
[10<span class="org-haskell-operator">,</span>20<span class="org-haskell-operator">,</span>30]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">to_list</span> list4
[1.25<span class="org-haskell-operator">,</span>0.65<span class="org-haskell-operator">,</span>8.123<span class="org-haskell-operator">,</span>9.434]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t to_list 
<span class="org-function-name">to_list</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">List</span> a <span class="org-haskell-operator">-&gt;</span> [a]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 0 <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 10 <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 0 list4
<span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 1 list4
<span class="org-haskell-constructor">Cons</span> 1.25 <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 2 list4
<span class="org-haskell-constructor">Cons</span> 1.25 (<span class="org-haskell-constructor">Cons</span> 0.65 <span class="org-haskell-constructor">Nil</span>)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 3 list4
<span class="org-haskell-constructor">Cons</span> 1.25 (<span class="org-haskell-constructor">Cons</span> 0.65 (<span class="org-haskell-constructor">Cons</span> 8.123 <span class="org-haskell-constructor">Nil</span>))
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 4 list4
<span class="org-haskell-constructor">Cons</span> 1.25 (<span class="org-haskell-constructor">Cons</span> 0.65 (<span class="org-haskell-constructor">Cons</span> 8.123 (<span class="org-haskell-constructor">Cons</span> 9.434 <span class="org-haskell-constructor">Nil</span>)))
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 5 list4
<span class="org-haskell-constructor">Cons</span> 1.25 (<span class="org-haskell-constructor">Cons</span> 0.65 (<span class="org-haskell-constructor">Cons</span> 8.123 (<span class="org-haskell-constructor">Cons</span> 9.434 <span class="org-haskell-constructor">Nil</span>)))
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 6 list4
<span class="org-haskell-constructor">Cons</span> 1.25 (<span class="org-haskell-constructor">Cons</span> 0.65 (<span class="org-haskell-constructor">Cons</span> 8.123 (<span class="org-haskell-constructor">Cons</span> 9.434 <span class="org-haskell-constructor">Nil</span>)))
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 26 list4
<span class="org-haskell-constructor">Cons</span> 1.25 (<span class="org-haskell-constructor">Cons</span> 0.65 (<span class="org-haskell-constructor">Cons</span> 8.123 (<span class="org-haskell-constructor">Cons</span> 9.434 <span class="org-haskell-constructor">Nil</span>)))

<span class="org-comment-delimiter">{-     </span>
<span class="org-comment">    Infinite List </span>
<span class="org-comment">-}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> ones <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> 1 ones
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 1 ones
<span class="org-haskell-constructor">Cons</span> 1 <span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 3 ones
<span class="org-haskell-constructor">Cons</span> 1 (<span class="org-haskell-constructor">Cons</span> 1 (<span class="org-haskell-constructor">Cons</span> 1 <span class="org-haskell-constructor">Nil</span>))
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 5 ones
<span class="org-haskell-constructor">Cons</span> 1 (<span class="org-haskell-constructor">Cons</span> 1 (<span class="org-haskell-constructor">Cons</span> 1 (<span class="org-haskell-constructor">Cons</span> 1 (<span class="org-haskell-constructor">Cons</span> 1 <span class="org-haskell-constructor">Nil</span>))))

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> from n <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> n (from (n<span class="org-haskell-operator">+</span>1))
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 3 (from 0)
<span class="org-haskell-constructor">Cons</span> 0 (<span class="org-haskell-constructor">Cons</span> 1 (<span class="org-haskell-constructor">Cons</span> 2 <span class="org-haskell-constructor">Nil</span>))
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 3 (from 3)
<span class="org-haskell-constructor">Cons</span> 3 (<span class="org-haskell-constructor">Cons</span> 4 (<span class="org-haskell-constructor">Cons</span> 5 <span class="org-haskell-constructor">Nil</span>))
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 10 (from 8)
<span class="org-haskell-constructor">Cons</span> 8 (<span class="org-haskell-constructor">Cons</span> 9 (<span class="org-haskell-constructor">Cons</span> 10 (<span class="org-haskell-constructor">Cons</span> 11 (<span class="org-haskell-constructor">Cons</span> 12 (<span class="org-haskell-constructor">Cons</span> 13 (<span class="org-haskell-constructor">Cons</span> 14 (<span class="org-haskell-constructor">Cons</span> 15 (<span class="org-haskell-constructor">Cons</span> 16 (<span class="org-haskell-constructor">Cons</span> 17 <span class="org-haskell-constructor">Nil</span>)))))))))


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> from_step start step <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Cons</span> start (from_step (start<span class="org-haskell-operator">+</span>step) step)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 3 (from_step 1 3)
<span class="org-haskell-constructor">Cons</span> 1 (<span class="org-haskell-constructor">Cons</span> 4 (<span class="org-haskell-constructor">Cons</span> 7 <span class="org-haskell-constructor">Nil</span>))
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 6 (from_step 2 4)
<span class="org-haskell-constructor">Cons</span> 2 (<span class="org-haskell-constructor">Cons</span> 6 (<span class="org-haskell-constructor">Cons</span> 10 (<span class="org-haskell-constructor">Cons</span> 14 (<span class="org-haskell-constructor">Cons</span> 18 (<span class="org-haskell-constructor">Cons</span> 22 <span class="org-haskell-constructor">Nil</span>)))))

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takel</span> 8 (from_step 0 1)
<span class="org-haskell-constructor">Cons</span> 0 (<span class="org-haskell-constructor">Cons</span> 1 (<span class="org-haskell-constructor">Cons</span> 2 (<span class="org-haskell-constructor">Cons</span> 3 (<span class="org-haskell-constructor">Cons</span> 4 (<span class="org-haskell-constructor">Cons</span> 5 (<span class="org-haskell-constructor">Cons</span> 6 (<span class="org-haskell-constructor">Cons</span> 7 <span class="org-haskell-constructor">Nil</span>)))))))

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">nth</span> (from_step 0 1) 0
0
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">nth</span> (from_step 0 1) 1
1
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">nth</span> (from_step 0 1) 2
2
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">nth</span> (from_step 0 1) 6
6
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">nth</span> (from_step 0 1) 22
22
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">nth</span> (from_step 0 1) 60
60
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t nth
<span class="org-function-name">nth</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-constructor">Eq</span> t<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Num</span> t) <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-constructor">List</span> t1 <span class="org-haskell-operator">-&gt;</span> t <span class="org-haskell-operator">-&gt;</span> t1
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapl</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 3<span class="org-haskell-operator">*</span>x <span class="org-haskell-operator">+</span> 5) list0
<span class="org-haskell-constructor">Nil</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapl</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 3<span class="org-haskell-operator">*</span>x <span class="org-haskell-operator">+</span> 5) list3
<span class="org-haskell-constructor">Cons</span> 35 (<span class="org-haskell-constructor">Cons</span> 65 (<span class="org-haskell-constructor">Cons</span> 95 <span class="org-haskell-constructor">Nil</span>))
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapl</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 3<span class="org-haskell-operator">*</span>x <span class="org-haskell-operator">+</span> 5) list4
<span class="org-haskell-constructor">Cons</span> 8.75 (<span class="org-haskell-constructor">Cons</span> 6.95 (<span class="org-haskell-constructor">Cons</span> 29.369 (<span class="org-haskell-constructor">Cons</span> 33.302 <span class="org-haskell-constructor">Nil</span>)))
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t mapl
<span class="org-function-name">mapl</span> <span class="org-haskell-operator">::</span> (t <span class="org-haskell-operator">-&gt;</span> a) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">List</span> t <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">List</span> a


<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> list4
<span class="org-haskell-constructor">Cons</span> 1.25 (<span class="org-haskell-constructor">Cons</span> 0.65 (<span class="org-haskell-constructor">Cons</span> 8.123 (<span class="org-haskell-constructor">Cons</span> 9.434 <span class="org-haskell-constructor">Nil</span>)))
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filterl</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">&gt;</span> 3.5) list4
<span class="org-haskell-constructor">Cons</span> 8.123 (<span class="org-haskell-constructor">Cons</span> 9.434 <span class="org-haskell-constructor">Nil</span>)
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filterl</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">&gt;</span> 8) list4
<span class="org-haskell-constructor">Cons</span> 8.123 (<span class="org-haskell-constructor">Cons</span> 9.434 <span class="org-haskell-constructor">Nil</span>)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t filterl
<span class="org-function-name">filterl</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Bool</span>) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">List</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">List</span> a
</pre>
</div>



<p>
Reference: 
</p>

<ul class="org-ul">
<li><a href="http://learnyouahaskell.com/making-our-own-types-and-typeclasses">http://learnyouahaskell.com/making-our-own-types-and-typeclasses</a>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Caio Rodrigues</p>
<p class="date">Created: 2016-03-22 Tue 04:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>